#  PANDAS

Pandas is an open-source python library that is used for data manipulation and analysis. It provides many functions and methods to speed up the data analysis process. Pandas is built on top of the NumPy package, hence it takes a lot of basic inspiration from it.

Pandas is a software library written for the Python programming language for data manipulation and analysis. ... 
The name is derived from the term "panel data", an econometrics term for data sets that include observations over multiple time periods for the same individuals.

The two primary data structures are Series which is 1 dimensional and DataFrame which is 2 dimensional.

In [1]:
import pandas as pd

# Series

In [2]:
pd.Series([11, 23, 34, 41, 55])

0    11
1    23
2    34
3    41
4    55
dtype: int64

In [4]:
pd.Series([20,21,22,23])

0    20
1    21
2    22
3    23
dtype: int64

In [5]:
pd.Series([11, 23, 34, 41, 55],index = ['Coca Cola', 'Sprite', 'Coke', 'Fanta', 'Dew'],name="Drinks")

Coca Cola    11
Sprite       23
Coke         34
Fanta        41
Dew          55
Name: Drinks, dtype: int64

# DataFrame

In [6]:
pd.DataFrame({'Yes': [50, 21], 'No': [131, 2]})

   Yes   No
0   50  131
1   21    2

In [7]:
pd.DataFrame({'Bob': ['I liked it.', 'It was awful.'], 'Sue': ['Pretty good.', 'Bland.']})

             Bob           Sue
0    I liked it.  Pretty good.
1  It was awful.        Bland.

In [8]:
pd.DataFrame({'Bob': ['I liked it.', 'It was awful.'], 
              'Sue': ['Pretty good.', 'Bland.']},
             index=['Product A', 'Product B'])

                     Bob           Sue
Product A    I liked it.  Pretty good.
Product B  It was awful.        Bland.

## Read

In [9]:
df=pd.read_csv("Data.csv")

In [10]:
df

    name  maths  phy result
0    tom     80   70   Pass
1   jhon     75   67   Pass
2    max     28   55   Fail
3    raj     88   70   Pass
4  shyam     23   29   Fail
5    ram     95   89   Pass

In [11]:
type(df)

pandas.core.frame.DataFrame

In [12]:
df[["maths","name"]]

   maths   name
0     80    tom
1     75   jhon
2     28    max
3     88    raj
4     23  shyam
5     95    ram

In [20]:
df1=pd.read_csv("annual-financial-year-provisional.csv")

In [21]:
df1

,Year,Industry_aggregation_NZSIOC,Industry_code_NZSIOC,Industry_name_NZSIOC,Units,Variable_code,Variable_name,Variable_category,Value,Industry_code_ANZSIC06
0,2021,Level 1,99999,All industries,Dollars (millions),H01,Total income,Financial performance,"757,504",ANZSIC06 divisions A-S (excluding classes K633...
1,2021,Level 1,99999,All industries,Dollars (millions),H04,"Sales, government funding, grants and subsidies",Financial performance,"674,890",ANZSIC06 divisions A-S (excluding classes K633...
2,2021,Level 1,99999,All industries,Dollars (millions),H05,"Interest, dividends and donations",Financial performance,"49,593",ANZSIC06 divisions A-S (excluding classes K633...
3,2021,Level 1,99999,All industries,Dollars (millions),H07,Non-operating income,Financial performance,"33,020",ANZSIC06 divisions A-S (excluding classes K633...
4,2021,Level 1,99999,All industries,Dollars (millions),H08,Total expenditure,Financial performance,"654,404",ANZSIC06 divisions A-S (excluding classes K633...
...,...,...,...,...,...,...,...,...,...,...
41710,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H37,Quick ratio,Financial ratios,52,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
41711,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H38,Margin on sales of goods for resale,Financial ratios,40,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
41712,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H39,Return on equity,Financial ratios,12,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
41713,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H40,Return on total assets,Financial ratios,5,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
41714,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H41,Liabilities structure,Financial ratios,46,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."

# head()

In [13]:
df.head()

    name  maths  phy result
0    tom     80   70   Pass
1   jhon     75   67   Pass
2    max     28   55   Fail
3    raj     88   70   Pass
4  shyam     23   29   Fail

In [14]:
df.head(3)

   name  maths  phy result
0   tom     80   70   Pass
1  jhon     75   67   Pass
2   max     28   55   Fail

# tail()

In [22]:
df1.tail()

,Year,Industry_aggregation_NZSIOC,Industry_code_NZSIOC,Industry_name_NZSIOC,Units,Variable_code,Variable_name,Variable_category,Value,Industry_code_ANZSIC06
41710,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H37,Quick ratio,Financial ratios,52,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
41711,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H38,Margin on sales of goods for resale,Financial ratios,40,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
41712,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H39,Return on equity,Financial ratios,12,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
41713,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H40,Return on total assets,Financial ratios,5,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
41714,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H41,Liabilities structure,Financial ratios,46,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."

In [23]:
df.tail(12)

    name  maths  phy result
0    tom     80   70   Pass
1   jhon     75   67   Pass
2    max     28   55   Fail
3    raj     88   70   Pass
4  shyam     23   29   Fail
5    ram     95   89   Pass

# sorting the names of columns

In [25]:
df4=pd.read_csv("Data.csv",header=None)
df4

       0      1    2       3
0   name  maths  phy  result
1    tom     80   70    Pass
2   jhon     75   67    Pass
3    max     28   55    Fail
4    raj     88   70    Pass
5  shyam     23   29    Fail
6    ram     95   89    Pass

In [26]:
df5=pd.read_csv("Data.csv",names=["a","b","c","d"])
df5

       a      b    c       d
0   name  maths  phy  result
1    tom     80   70    Pass
2   jhon     75   67    Pass
3    max     28   55    Fail
4    raj     88   70    Pass
5  shyam     23   29    Fail
6    ram     95   89    Pass

In [27]:
df6=pd.read_csv("Data.csv",names=["a","b","c","d","e"])
df6

       a      b    c       d   e
0   name  maths  phy  result NaN
1    tom     80   70    Pass NaN
2   jhon     75   67    Pass NaN
3    max     28   55    Fail NaN
4    raj     88   70    Pass NaN
5  shyam     23   29    Fail NaN
6    ram     95   89    Pass NaN

## shape

In [28]:
df=pd.read_csv("Data.csv")

In [29]:
df

    name  maths  phy result
0    tom     80   70   Pass
1   jhon     75   67   Pass
2    max     28   55   Fail
3    raj     88   70   Pass
4  shyam     23   29   Fail
5    ram     95   89   Pass

In [30]:
df.shape

(6, 4)

In [31]:
df.shape[0]

6

In [32]:
df.shape[1]

4

## info()

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   maths   6 non-null      int64
 2   phy     6 non-null      int64
 3   result  6 non-null      object
dtypes: int64(2), object(2)
memory usage: 324.0+ bytes

# isnull()

In [34]:
df.isnull()

    name  maths    phy  result
0  False  False  False   False
1  False  False  False   False
2  False  False  False   False
3  False  False  False   False
4  False  False  False   False
5  False  False  False   False

In [35]:
df.isnull().sum()

name      0
maths     0
phy       0
result    0
dtype: int64

## drop()

In [37]:
df10=df.drop("name",axis=1)
df10

   maths  phy result
0     80   70   Pass
1     75   67   Pass
2     28   55   Fail
3     88   70   Pass
4     23   29   Fail
5     95   89   Pass

# describe()

In [38]:
df["maths"].max()
df["phy"].min()
df["phy"].mean()
df["maths"].median()
df["result"].mode()
df["maths"].std()

31.262864018938934

In [39]:
df.describe()

           maths        phy
count   6.000000   6.000000
mean   64.833333  63.333333
std    31.262864  20.046612
min    23.000000  29.000000
25%    39.750000  58.000000
50%    77.500000  68.500000
75%    86.000000  70.000000
max    95.000000  89.000000

# value_counts()

In [41]:
df=pd.read_csv("Data.csv")
df

    name  maths  phy result
0    tom     80   70   Pass
1   jhon     75   67   Pass
2    max     28   55   Fail
3    raj     88   70   Pass
4  shyam     23   29   Fail
5    ram     95   89   Pass

In [42]:
df.result.value_counts()

result
Pass    4
Fail    2
Name: count, dtype: int64

## nunique()

In [43]:
df["result"].unique()

array(['Pass', 'Fail'], dtype=object)

In [44]:
df["result"].nunique()

2

# Seed
Seed function is used to save the state of a random function, 
so that it can generate same random numbers on multiple executions of the code on the same machine or on different machines (for a specific seed value). 

The seed value is the previous value number generated by the generator.

In [45]:
np.random.seed(1)
r=rn(4,3)  #Creating Random Dataset 
r

array([[ 1.62434536, -0.61175641, -0.52817175],
       [-1.07296862,  0.86540763, -2.3015387 ],
       [ 1.74481176, -0.7612069 ,  0.3190391 ],
       [-0.24937038,  1.46210794, -2.06014071]])

In [46]:
rdf=pd.DataFrame(r)
rdf

          0         1         2
0  1.624345 -0.611756 -0.528172
1 -1.072969  0.865408 -2.301539
2  1.744812 -0.761207  0.319039
3 -0.249370  1.462108 -2.060141

In [47]:
row=["a","b","c","d"]
col=["x","y","z"]
rdf=pd.DataFrame(r,index=row,columns=col)
rdf

          x         y         z
a  1.624345 -0.611756 -0.528172
b -1.072969  0.865408 -2.301539
c  1.744812 -0.761207  0.319039
d -0.249370  1.462108 -2.060141

In [48]:
rdf[["x","y"]]

          x         y
a  1.624345 -0.611756
b -1.072969  0.865408
c  1.744812 -0.761207
d -0.249370  1.462108

#  loc() and iloc()

loc() and iloc() methods are used in slicing data from the pandas DataFrame which helps in filtering the data according to some given condition.

1.loc â€“ select by labels

2.iloc â€“ select by positions

In [51]:
rdf.loc[["a","d"],["x","y"]]

          x         y
a  1.624345 -0.611756
d -0.249370  1.462108

In [52]:
rdf.iloc[[0,3],[0,1]]

          x         y
a  1.624345 -0.611756
d -0.249370  1.462108

In [53]:
rdf.iloc[0:3,0:1]

          x
a  1.624345
b -1.072969
c  1.744812

## set_index()

In [54]:
rdf.set_index("x") #â€œset_index()â€ function to set any of your columns as the index

                  y         z
x
 1.624345 -0.611756 -0.528172
-1.072969  0.865408 -2.301539
 1.744812 -0.761207  0.319039
-0.249370  1.462108 -2.060141

# reset_index

In [56]:
rdf

          x         y         z
a  1.624345 -0.611756 -0.528172
b -1.072969  0.865408 -2.301539
c  1.744812 -0.761207  0.319039
d -0.249370  1.462108 -2.060141

In [58]:
#reset index of the dataframe object to default indexing (0 to number of rows minus 1) or to reset multi level index

In [57]:
rdf.reset_index()

  index         x         y         z
0     a  1.624345 -0.611756 -0.528172
1     b -1.072969  0.865408 -2.301539
2     c  1.744812 -0.761207  0.319039
3     d -0.249370  1.462108 -2.060141

## groupby()

In [60]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [61]:
byComp = df.groupby('Company')

In [65]:
byComp.mean('Sales')

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [67]:
byComp.sum('Sales')

         Sales
Company
FB         593
GOOG       320
MSFT       464

# concat()

We can perform concatenation of pandas object into a DataFrame output along a particular axis with optional set logic such as union and intersection using concat() method.

By default, axis=0, i.e. row-wise concatenation, 

so if we set axis=1, column-wise concatenation will be performed.

In [6]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [11]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         )
df2

    A   B   C   D
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

In [4]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8,9,10,11])
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [30]:
# df_cat1 = pd.concat([df1,df2], axis=0)
# df_cat1

df_app = df1.append(df2)

C:\Users\Acer\AppData\Local\Temp\ipykernel_11768\2751940768.py:4: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df_app = df1.append(df2)

In [19]:
df_cat2 = pd.concat([df1,df2,df3], axis=0)
df_cat2

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
0    A4   B4   C4   D4
1    A5   B5   C5   D5
2    A6   B6   C6   D6
3    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

# Merging

â€œMergingâ€ two datasets is the process of bringing two datasets together into one, and aligning the rows from each based on common attributes or columns. The w o rds â€œmergeâ€ and â€œjoinâ€ are used relatively interchangeably in Pandas and other languages.

In [37]:
left = pd.DataFrame({'key': ['K0', 'K8', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
left.dtypes

key    object
A      object
B      object
dtype: object

In [38]:
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})
right.dtypes

key    object
C      object
D      object
dtype: object

In [22]:
#inner join

In [39]:
# merge1= pd.merge(left,right,how='inner',on='key')
left.join(right)

ValueError: columns overlap but no suffix specified: Index(['key'], dtype='object')

In [78]:
#left join

In [79]:
merge2=pd.merge(left, right, how='left',on=['key', 'key'])
merge2

  key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K8  A1  B1  NaN  NaN
2  K2  A2  B2   C2   D2
3  K3  A3  B3   C3   D3

In [80]:
#right join

In [81]:
merge3=pd.merge(left, right, how='right',on=['key', 'key'])
merge3

  key    A    B   C   D
0  K0   A0   B0  C0  D0
1  K1  NaN  NaN  C1  D1
2  K2   A2   B2  C2  D2
3  K3   A3   B3  C3  D3

## Date functionality

In [84]:
#Create a Range of Dates

In [87]:
import pandas as pd

pd.date_range('1/1/2011', periods=5)

DatetimeIndex(['2011-01-01', '2011-01-02', '2011-01-03', '2011-01-04',
               '2011-01-05'],
              dtype='datetime64[ns]', freq='D')

In [85]:
#Change the Date Frequency

In [86]:
import pandas as pd

pd.date_range('1/1/2011', periods=5,freq='M')

DatetimeIndex(['2011-01-31', '2011-02-28', '2011-03-31', '2011-04-30',
               '2011-05-31'],
              dtype='datetime64[ns]', freq='M')

In [88]:
#business date ranges(bdate_range())

In [89]:
import pandas as pd

pd.date_range('1/1/2011', periods=5)

DatetimeIndex(['2011-01-01', '2011-01-02', '2011-01-03', '2011-01-04',
               '2011-01-05'],
              dtype='datetime64[ns]', freq='D')

# Apply() function and sorting

In [93]:
df = pd.DataFrame({'col1':[1,2,3,4,5,6,7,8,9,10],
                   'col2':[444,555,666,444,333,222,666,777,666,555],
                   'col3':'aaa bb c dd eeee fff gg h iii j'.split()})
df

   col1  col2  col3
0     1   444   aaa
1     2   555    bb
2     3   666     c
3     4   444    dd
4     5   333  eeee
5     6   222   fff
6     7   666    gg
7     8   777     h
8     9   666   iii
9    10   555     j